(function (win) {
  "use strict";

  var helpers = win.WeddingHelpers || {};

  win.WeddingInvites = {
    default: helpers.getDefaultInviteText("Гості"),
    guest: "Запрошуємо вас бути свідками цієї урочистої події.",
    styrianky:
      "Дорогі Ілля і Юліє! Запрошуємо вас стати свідками найважливішої події в нашому житті а саме створення нашої сім’ї. Заодно і потусимо разом як має бути😏. Будемо дуже раді бачити вас поруч",
    // Рівне
    best_couple:
      "Дорогі Іване та Каміліє! Запрошуємо вас на наше весілля 🥰. Якщо ви не приїдете, то його не буде. Тому мусите бути, інакше вам доведеться придумувати пояснення Івановому татові, чому не потрібно пекти коровай",
    anton_nastia: helpers.getDefaultInviteText("Антон і Настя"),

    khodiuk_brother_family:
      "Дорогі Влад і Таня! Запрошуємо відвідати Тернопіль у день коли закінчиться таймер. Тут буде урочиста подія, треба Владові чучуть підушнити🤣. Будемо дуже раді бачити вас поруч у цей важливий для нас день",
    shlikhta_parents: helpers.getDefaultInviteText("Тато і Мама"),
    shlikhta_brother_family: helpers.getDefaultInviteText("Женя та Альона"),
    artur_zoriana:
      "Дорогі Артур і Зорянія! Запрошуємо вас потусити разом у цей день і стати свідками найважливішої події в нашому житті — створення нашої сім’ї. Будемо дуже раді бачити вас поруч.",

    // Родичі
    katya_petro: helpers.getDefaultInviteText("Катя та Петро"),
    vitya_marta: helpers.getDefaultInviteText("Віктор і Марто"),
    sasha_bro:
      "Дорогий Саша! Запрошуємо тебе на цю важливу подію у нашому житті. Будемо дуже раді бачити тебе поруч у цей особливий момент, разом святкувати, радіти й створювати незабутні спогади.",
    alona_misha:
      "Дорогі Альона та Міша! Запрошуємо вас розділити цю важливу подію у нашому житті, будемо дуже раді бачити вас поруч у цей особливий момент. Ми таки скоро приїдемо у Франківськ, але вже після весілля😄",
    nastua:
      "Дорога Насте! Запрошуємо тебе розділити з нами цю важливу подію в нашому житті. Будемо дуже раді бачити тебе поруч у цей особливий момент — разом святкувати, радіти й створювати незабутні спогади.",
    khodiuk_parents: helpers.getDefaultInviteText("Тато і Мама"),
    viktoria_vitalii: helpers.getDefaultInviteText("Вікторія та Віталій"),
    alik_tetiana: helpers.getDefaultInviteText("Алік і Тетяна"),
    oleksand_olesia:
      "Дорога сім`я Климчуків! Запрошуємо вас розділити цю важливу подію у нашому житті будемо дуже раді бачити вас поруч у цей особливий момент.",
    vitalii:
      "Дорогий Віталій! Запрошуємо тебе на цю важливу подію у нашому житті. Будемо дуже раді бачити тебе поруч у цей особливий момент, разом святкувати, радіти й створювати незабутні спогади.",
    // Колеги
    vova: "Дорогий Володимир! Запрошуємо тебе на цю важливу подію у нашому житті. Будемо дуже раді бачити тебе поруч у цей особливий момент. Треба буде трошки рими наскладати і реп зачитати🤣",
    ihor_valeriia:
      "Дорогі Ігор (начальнік) та Валерія! Запрошуємо вас на цю важливу подію у нашому житті. Вчесть цього вібудеться грандіозна туса, будуть грати всякі пісні (fuck off, etc.). Буде Ігора сусід ведучий, має бути весело😄. Будемо дуже раді бачити вас поруч у цей день.",
    ivan_colleague: "Дорогий Іван! Запрошуємо тебе на цю важливу подію у нашому житті. Будемо дуже раді бачити тебе поруч у цей особливий момент🤣",
    ivan_svitlana: helpers.getDefaultInviteText("Іван і Світлана"),
    vitalii_tetiana: helpers.getDefaultInviteText("Віталій і Тетяна"),

    maksym_oleksandra: helpers.getDefaultInviteText("Максим і Олександра"),
    mykola_tetiana: helpers.getDefaultInviteText("Микола і Тетяна"),
  };
})(window);
