(function (win) {
  "use strict";

  var helpers = win.WeddingHelpers || {};
  var regions = win.WeddingInvitesRegions || (win.WeddingInvitesRegions = {});

  regions.rivne = {
    best_couple: `Дорогі Іване та Каміліє!

Запрошуємо вас на наше весілля! (Пздц ми одружуємося, ми в ахуї)

Ви для нас не просто друзі - ви дуже близькі люди, частина нашого життя, з якими пов’язано багато теплих моментів. Ми вас дуже любимо і знаємо, що завжди будемо поруч одне для одного.

Для нас справді дуже  важливо, щоб Ваня доїхав в Тернопіль, а не на Запорізький напрямок і щоб у цей день ви були поряд і розділили з нами цю радість.

Якщо ви не приїдете, то весілля не буде. Тому маєте бути, інакше вам доведеться придумувати пояснення Івановому татові, чому не потрібно пекти коровай 😄  
І взагалі - нам абсолютно не важливо, що ви малоімущєствені або якісь там там ше.

З любов’ю Юра і Юля ❤️
      `,
    anton_nastia: `Дорогі Антоне та Настю!

Ми щиро запрошуємо вашу чудову пару розділити з нами радість створення нашої сім’ї🥂

Ви - наші хороші друзі, і нам було б неймовірно приємно бачити вас у цей особливий день🫂

Антоне, ми дуже пишаємося тобою і щиро сподіваємося, що служба дозволить тобі бути поруч із нами. Настю, ми дуже раді за ваш новий етап і будемо щасливі бачити тебе♥️

Ваша присутність зробить наше свято по-справжньому теплим і особливим. Дуже чекаємо на вас і щиро віримо, що у вас вийде приїхати!

З величезною любов’ю Юра та Юля♥️`,

    olia_maksym: `Дорогі Олю та Максиме!

Ми щиро запрошуємо вашу чудову пару розділити з нами радість створення нашої сім’ї🥂

Нам буде дуже приємно бачити вас серед наших гостей у цей особливий та святковий для нас день.

Ви надзвичайно прикольні та позитивні люди, тому ми впевнені, що ваша присутність додасть нашому святу крутого настрою та драйву! З великою радістю Тернопіль чекає Рівне! Сливку візьміть!

З любов’ю Юра та Юля♥️`,
  };
})(window);
// 6 рівне