(function (win) {
  "use strict";

  var helpers = win.WeddingHelpers || {};
  var regions = win.WeddingInvitesRegions || (win.WeddingInvitesRegions = {});

  regions.yura_relatives = {
    katya_petro: `Дорогі Катя і Петро!

Запрошуємо вас стати свідками створення нашої сімʼї.

Для нас ви не просто тітка і дядько, а по-справжньому близькі люди - частина нашої сімʼї. Ваша підтримка, турбота і тепло завжди були дуже важливими, і ми щиро вдячні вам за це.

Для нас буде великою радістю розділити цей особливий день разом із вами, адже ви займаєте особливе місце в нашому житті.

З любов’ю, Юра та Юля ❤️`,
    vitya_marta: `Дорогі Вітю та Марто!

Ми щиро запрошуємо вашу чудову пару розділити з нами радість створення нашої сім’ї🥂

Нам буде дуже приємно бачити вас серед найближчих людей у цей особливий для нас день🫂

Ваша присутність додасть нашому святу справжнього родинного тепла та класного настрою. З нетерпінням чекаємо на зустріч!

А, і сорі, що весілля не в печері( надіємось вам і так сподобається((

З любов’ю Юра та Юля♥️`,
    sasha_bro: `Сашка!

Запрошуємо тебе на найважливіший день у нашому житті — створення нашої сімʼї!

Нам буде дуже приємно, якщо ти розділиш із нами цей день і додаси ще більше настрою та драйву до свята 🥰

З любов’ю Юра та Юля♥️`,
    pavlyshynets: `Дорога сімʼє Павлишинець!

Запрошуємо вас стати частиною особливого дня - створення нашої сімʼї.

Альоно, Мішка та Настю, нам дуже приємно, що ви є в нашому житті. Ваша щирість, тепло і родинна атмосфера завжди створюють відчуття затишку та радості. Ми щиро цінуємо наш зв’язок і будемо безмежно раді розділити цей важливий момент разом із вами. 
P.S. Шкода, що Мішка не може привести своєї пюрешки на весілля🤤

Чекаємо на вас із Франківська з гарним настроєм і усмішками ❤️`,
    khodiuk_parents: `Дорогі мама і тато!

Запрошуємо вас стати свідками створення нової сімʼї.

Настав час нам створити власну сім’ю, спираючись на ті цінності, які ви в нас заклали.

Ми безмежно вдячні вам за вашу турботу, тепло і любов, які супроводжували нас усе життя. Для нас дуже важливо, щоб у цей особливий день ви були поруч і розділили з нами цю радість.

З любов’ю, ваші діти ❤️`,
    khodiuk_brother_family: `Дорогі Влад і Таню!

Запрошуємо вас на наше весілля 🥹

Влад, ти не просто брат, а людина, з якою завжди легко та весело. Дякую, що був поруч у важкі моменти, та зараз хочемо, аби ти розділив з нами і щасливі! Таню, дякуємо, що терпиш душноту, але знай - завжди можна відкрити форточку🧘
Одразу попереджаємо: цього дня можна офіційно пропустити тренування, але! танці - обов’язкові!

Ми дуже раді, що ви є в нашому житті, і хочемо, щоб у цей особливий день ви були поруч і розділили з нами ці емоції.

Чекаємо на вас з гарним настроєм та усмішками!

З любов’ю Юра і Юля ❤️`,
    viktoria_vitalii: `Дорогі Віко та Віталіку!

Ми щиро запрошуємо вашу чудову пару розділити з нами найважливіший день - створення нашої сім’ї🥂

Віко, для нас ти дуже близька людина, і ми просто не уявляємо це свято без твоєї підтримки та щирої усмішки поруч🫂

Ваша присутність зробить наше весілля по-справжньому рідним і теплим. З великою радістю чекаємо на вас обох!

З любов’ю Юра та Юля♥️`,
    alik_tetiana: `Дорогі Таню та Аліку!

Ми щиро запрошуємо вашу сімʼю розділити з нами створення нашоі нової родини🥂

Нам буде дуже приємно бачити вас серед наших гостей у цей особливий та святковий для нас день.

Ваша присутність додасть нашому святу чудового настрою та тепла. З великою радістю чекатимемо на вас!

З любов’ю Юра та Юля♥️`,
    ruslan_natalia: `Дорогі Руслане, Наталю та Максиме!

Ми щиро запрошуємо вашу сім’ю розділити з нами радість створення нашої нової родини🥂

Нам буде дуже приємно бачити вас серед наших гостей у цей особливий та святковий для нас день.

Ваша присутність додасть нашому весіллю справжнього родинного затишку та тепла. З великою радістю чекатимемо на вашу чудову сім’ю!

З любов’ю Юра та Юля♥️`,
    demchuky: `Дорога сім’я Демчуків!

Ми щиро запрошуємо вашу чудову родину розділити з нами радість створення нашої нової сім’ї🥂

Нам буде дуже приємно бачити вас серед наших гостей у цей особливий та святковий для нас день.

Ваша присутність додасть нашому весіллю справжнього родинного затишку та тепла. З великою радістю чекатимемо на вас!

З любов’ю Юра та Юля♥️`,
    sobchuky: `Дорога сім’я Собчуків!

Ми щиро запрошуємо вашу чудову родину розділити з нами радість створення нашої нової сім’ї🥂

Нам буде дуже приємно бачити вас серед наших гостей у цей особливий та святковий для нас день.

Ваша присутність додасть нашому весіллю справжнього родинного затишку та тепла. З великою радістю чекатимемо на вас!

З любов’ю Юра та Юля♥️`,
    sonia_viktor: `Дорогі Соня і Віктор!

Ми щиро запрошуємо вашу сім’ю розділити з нами радість створення нашої нової родини🥂

Нам буде дуже приємно бачити вас серед наших гостей у цей особливий та святковий для нас день.

Ваша присутність додасть нашому весіллю справжнього родинного затишку та тепла. З великою радістю чекатимемо на вашу чудову сім’ю!

З любов’ю Юра та Юля♥️`,
  };
})(window);
// 26 родичів