(function (win) {
  "use strict";

  var regions = win.WeddingInvitesRegions || (win.WeddingInvitesRegions = {});

  regions.yulia_colleagues = {
    uliasia_taras: `Дорогі Улясю та Тарасе!

Ми щиро запрошуємо вашу чудову пару розділити з нами радість створення нашої сім’ї🥂

Нам буде дуже приємно бачити вас серед наших гостей у цей особливий день🫂

Улясю, ти неймовірно світла та хороша людина, і я з великим теплом згадую наш спільно проведений час в оветі. Твоя доброта та щирість завжди надихають, тому ми будемо дуже щасливі, якщо ви прикрасите наше свято своєю присутністю.

З великою радістю чекаємо вас обох!
P.S. Каролінку залишайте мамі, бо на весіллі буде бармен, де ви з Тарасом будете відриватися по повній!

З любов’ю Юра та Юля♥️`,

    oxana_vitya: `Дорогі Оксано та Вітю!

Ми щиро запрошуємо вашу чудову пару розділити з нами радість створення нашої сім’ї🥂

Оксано, мені надзвичайно приємно, що наше знайомство на роботі переросло у тепле спілкування, і я дуже ціную твою підтримку та щирість та спокій🧘🏻

Ваша присутність зробить наше свято ще яскравішим та незабутнім. З нетерпінням чекаємо на вас обох!

З любов’ю Юра та Юля♥️`,
    khrystia_nazar: `Дорогі Христю та Назаре!

Ми щиро запрошуємо вашу пару розділити з нами радість створення нашої сім’ї🥂

Христю, мені надзвичайно приємно, що наше робоче спілкування переросло у теплу дружбу, і я дуже ціную твою щирість та підтримку🫂

Ваша присутність зробить наше свято ще радіснішим та незабутнім. 
З нетерпінням чекаємо на вас обох!

З любов’ю Юра та Юля♥️`,
    natali: `Дорога Наталі!

Ми щиро запрошуємо тебе розділити з нами радість створення нашої сім’ї🥂

І навіть не думай шукати відмовки, бо ти мусиш бути на нашому весіллі, нічо не знаю!

Я дуже ціную твою щирість та безпосередність. 
Обіцяю, що на весіллі місця для відпочинку буде значно більше, ніж на нашому робочому місці!

З нетерпінням чекаємо на тебе!

З любов’ю Юра та Юля♥️`,
    oksana_yurii: `Дорогі ОІ та Юро!

Ми щиро запрошуємо вашу чудову пару розділити з нами радість створення нашої нової сім’ї. Нам буде дуже приємно бачити вас серед наших гостей у цей особливий та святковий для нас день.

Оксано Ігорівно, мені надзвичайно приємно було працювати під Вашим керівництвом у клініці, і я щиро вдячна за Ваш досвід та підтримку. Ваша з Юрою присутність додасть нашому святу особливого статусу та тепла♥️

З великою радістю та повагою чекаємо вас обох!
P.S. Олічку залишайте мамі, бо батьки в цей день будуть відриватися!🤭

З любов’ю Юра та Юля♥️`,
    lilia: `Дорога Лілічка!

Ми щиро запрошуємо тебе розділити з нами радість створення нашої сім’ї♥️

Нам буде неймовірно приємно бачити тебе серед наших гостей у цей особливий день.

Лілю, я з великим теплом згадую нашу спільну роботу в «Оветі». Ти надзвичайно хороша та розуміюча людина, яка завжди вміє вислухати та підтримати у потрібну мить. Поруч із тобою завжди так затишно та комфортно, тому твоя присутність зробить наше свято по-справжньому теплим.

З великою радістю та любов’ю чекаємо на тебе!

З любов’ю Юра та Юля♥️`,
  };
})(window);
// 10 колег