(function (win) {
  "use strict";

  var helpers = win.WeddingHelpers || {};

  win.WeddingInvites = {
    default: helpers.getDefaultInviteText("Гості"),
    guest: "Запрошуємо вас бути свідками цієї урочистої події.",
    styrianky:
      "Дорогі Ілля і Юліє! Запрошуємо вас стати свідками найважливішої події в нашому житті а саме створення нашої сім’ї. Заодно і потусимо разом як має бути😏. Будемо дуже раді бачити вас поруч",
    // Рівне
    best_couple:
      "Дорогі Іване та Каміліє! Запрошуємо вас на наше весілля 🥰. Якщо ви не приїдете, то його не буде. Тому мусите бути, інакше вам доведеться придумувати пояснення Івановому татові, чому не потрібно пекти коровай",
    anton_nastia: helpers.getDefaultInviteText("Антон і Настя"),

    khodiuk_brother_family:
      "Дорогі Влад і Таня! Запрошуємо відвідати Тернопіль у день коли закінчиться таймер. Тут буде урочиста подія, треба Владові чучуть підушнити🤣. Будемо дуже раді бачити вас поруч у цей важливий для нас день",
    shlikhta_parents: `Дорогі мама і тато!

Запрошуємо вас стати свідками створення нової сімʼї.

Ваші сім’ї завжди були для нас прикладом любові та підтримки. Саме завдяки вам ми знаємо, як важливо берегти одне одного. І тепер настав час нам створити власну сім’ю, спираючись на ті цінності, які ви в нас заклали.

Ми безмежно вдячні вам за вашу турботу, тепло і любов, які супроводжували нас усе життя. Для нас дуже важливо, щоб у цей особливий день ви були поруч і розділили з нами цю радість.

З любов’ю, ваші діти ❤️`,
    shlikhta_brother_family: helpers.getDefaultInviteText("Женя та Альона"),
    artur_zoriana:
      "Дорогі Артур і Зорянія! Запрошуємо вас потусити разом у цей день і стати свідками найважливішої події в нашому житті — створення нашої сім’ї. Будемо дуже раді бачити вас поруч.",

    // Родичі
    katya_petro: `Дорогі Катя і Петро!

Запрошуємо вас стати свідками створення нашої сімʼї.

Для нас ви не просто тітка і дядько, а по-справжньому близькі люди - частина нашої сімʼї. Ваша підтримка, турбота і тепло завжди були дуже важливими, і ми щиро вдячні вам за це.

Для нас буде великою радістю розділити цей особливий день разом із вами, адже ви займаєте особливе місце в нашому житті.

З любов’ю, Юра та Юля ❤️`,
    vitya_marta: helpers.getDefaultInviteText("Віктор і Марто"),
    sasha_bro:
      `Сашка!

Запрошуємо тебе на найважливіший день у нашому житті — створення нашої сімʼї!

Нам буде дуже приємно, якщо ти розділиш із нами цей день і додаси ще більше настрою та драйву до свята 🥰

Чекаємо на тебе!`,
    alona_misha:
      "Дорогі Альона та Міша! Запрошуємо вас розділити цю важливу подію у нашому житті, будемо дуже раді бачити вас поруч у цей особливий момент. Ми таки скоро приїдемо у Франківськ, але вже після весілля😄",
    nastua:
      "Дорога Насте! Запрошуємо тебе розділити з нами цю важливу подію в нашому житті. Будемо дуже раді бачити тебе поруч у цей особливий момент — разом святкувати, радіти й створювати незабутні спогади.",
    khodiuk_parents: `Дорогі мама і тато!

Запрошуємо вас стати свідками створення нової сімʼї.

Настав час нам створити власну сім’ю, спираючись на ті цінності, які ви в нас заклали.

Ми безмежно вдячні вам за вашу турботу, тепло і любов, які супроводжували нас усе життя. Для нас дуже важливо, щоб у цей особливий день ви були поруч і розділили з нами цю радість.

З любов’ю, ваші діти ❤️`,
    viktoria_vitalii: helpers.getDefaultInviteText("Вікторія та Віталій"),
    alik_tetiana: helpers.getDefaultInviteText("Алік і Тетяна"),
    oleksand_olesia:
      "Дорога сім`я Климчуків! Запрошуємо вас розділити цю важливу подію у нашому житті будемо дуже раді бачити вас поруч у цей особливий момент.",
    vitalii:
      "Дорогий Віталій! Запрошуємо тебе на цю важливу подію у нашому житті. Будемо дуже раді бачити тебе поруч у цей особливий момент, разом святкувати, радіти й створювати незабутні спогади.",
    // Колеги
    vova: "Дорогий Володимир! Запрошуємо тебе на цю важливу подію у нашому житті. Будемо дуже раді бачити тебе поруч у цей особливий момент. Треба буде трошки рими наскладати і реп зачитати🤣",
    ihor_valeriia:
      `Дорогі Ігор (начальнік) та Валерія!

      Запрошуємо вас на цю важливу подію у нашому житті. В честь цього вібудеться грандіозна туса
      Навіть ведучим буде Ігора сусід😎
      Будемо дуже раді бачити вас поруч у цей день.
      
      З любов'ю Юля та Юра ❤️ і FUCK OFF чи шо
      `,
    ivan_colleague:
      "Дорогий Іван! Запрошуємо тебе на цю важливу подію у нашому житті. Будемо дуже раді бачити тебе поруч у цей особливий момент🤣",
    ivan_svitlana: helpers.getDefaultInviteText("Іван і Світлана"),
    vitalii_tetiana: helpers.getDefaultInviteText("Віталій і Тетяна"),

    maksym_oleksandra: helpers.getDefaultInviteText("Максим і Олександра"),
    mykola_tetiana: helpers.getDefaultInviteText("Микола і Тетяна"),
  };
})(window);
