(function (win) {
  "use strict";

  var regions = win.WeddingInvitesRegions || (win.WeddingInvitesRegions = {});

  regions.colleagues = {
    vova: `Дорогий Вова!

Запрошуємо тебе на наше весілля 🥂

Без тебе цей день точно не буде таким атмосферним - хто ж зачитає нам реп і розкачає настрій? Га?

Нам дуже важливо, щоб ти був поруч і розділив із нами цей день.

Чекаємо на тебе - буде гучно, весело і душевно 🔥

З любов’ю Юра і Юля ❤️`,
    ihor_valeriia: `Дорогі Ігор (начальнік) та Валерія!

Запрошуємо вас на цю важливу подію у нашому житті. В честь цього вібудеться грандіозна туса
Навіть ведучим буде Ігора сусід😎
Будемо дуже раді бачити вас поруч у цей день.
      
З любов'ю Юля та Юра ❤️ і FUCK OFF чи шо`,
    ivan_colleague: `Дорогий Іване!

Запрошуємо тебе на наше весілля 🥂

Будемо щиро раді розділити з тобою цей особливий для нас день. Для нас важливо, щоб поруч були приємні та близькі люди.

Чекаємо на тебе!

З любов’ю Юра і Юля ❤️`,
    ivan_svitlana: `Дорогі Іване та Світлано!

Запрошуємо вас на наше весілля 🥂

Ще зовсім недавно ми були у вас на святі, а тепер прийшла наша черга приймати гостей 🥹
Дуже хочемо розділити цей особливий день саме з вами!

Будемо дуже раді бачити вас поруч у цей важливий для нас день.

P.S. Іван, без відео-привітання від Вікторії Спорт не приходьте.

З любов’ю Юра і Юля ❤️`,
    vitalii_tetiana: `Дорогі Віталік і Таню!

Запрошуємо вас на наше весілля 🥂

Будемо щиро раді розділити з вами цей особливий для нас день. Дуже приємно, що ви є в нашому житті, і хочемо, щоб ви були поруч у цю важливу мить.

Чекаємо на вас у гарному настрої та з усмішками 🤗

З любов’ю Юра і Юля ❤️`,
  };
})(window);
// 8 колег