(function (win) {
  "use strict";

  var helpers = win.WeddingHelpers || {};
  var regions = win.WeddingInvitesRegions || (win.WeddingInvitesRegions = {});

  regions.stepchuky = {
    maksym_oleksandra: `Дорогі Максиме та Сашо!

Ми щиро запрошуємо вашу пару розділити з нами радість створення нашої сім’ї🥂

Нам буде дуже приємно бачити вас серед наших гостей у цей особливий та святковий для нас день.

Ваша присутність додасть нашому святу чудового настрою та тепла. З великою радістю чекатимемо на вас!

З любов’ю Юра та Юля♥️`,
    mykola_tetiana: `Дорогий хресний Миколо та тьотю Таню!

Ми щиро запрошуємо вашу чудову сім’ю розділити з нами радість створення нашої нової родини🥂

Для нас дуже важливо, щоб хресний батько був поруч у такий відповідальний і щасливий момент.

Ваша присутність зробить наше свято ще теплішим та сповненим родинного затишку. Будемо неймовірно раді бачити вас обох!

З любов’ю Юра та Юля♥️`,
  };
})(window);
// 4 степчуки