(function (win) {
  "use strict";

  var helpers = win.WeddingHelpers || {};

  win.WeddingInvites = {
    default: helpers.getDefaultInviteText("Гості"),
    guest: "Запрошуємо вас бути свідками цієї урочистої події.",
    styrianky:
      "Дорогі Ілля і Юліє! Запрошуємо вас стати свідками найважливішої події в нашому житті а саме створення нашої сім’ї. Заодно і потусимо разом як має бути😏. Будемо дуже раді бачити вас поруч",
    // Рівне
    best_couple:
      `Дорогі Іване та Каміліє!

Запрошуємо вас на наше весілля! (Пздц ми одружуємося, ми в ахуї)

Ви для нас не просто друзі - ви дуже близькі люди, частина нашого життя, з якими пов’язано багато теплих моментів. Ми вас дуже любимо і знаємо, що завжди будемо поруч одне для одного.

Для нас справді дуже  важливо, щоб Ваня доїхав в Тернопіль, а не на Запорізький напрямок і щоб у цей день ви були поряд і розділили з нами цю радість.

Якщо ви не приїдете, то весілля не буде. Тому маєте бути, інакше вам доведеться придумувати пояснення Івановому татові, чому не потрібно пекти коровай 😄  
І взагалі - нам абсолютно не важливо, що ви малоімущєствені або якісь там там ше.

З любов’ю Юра і Юля ❤️
      `,
    anton_nastia: helpers.getDefaultInviteText("Антон і Настя"),

    khodiuk_brother_family:
      "Дорогі Влад і Таня! Запрошуємо відвідати Тернопіль у день коли закінчиться таймер. Тут буде урочиста подія, треба Владові чучуть підушнити🤣. Будемо дуже раді бачити вас поруч у цей важливий для нас день",
    shlikhta_parents: `Дорогі мама і тато!

Запрошуємо вас стати свідками створення нової сімʼї.

Ваші сім’ї завжди були для нас прикладом любові та підтримки. Саме завдяки вам ми знаємо, як важливо берегти одне одного. І тепер настав час нам створити власну сім’ю, спираючись на ті цінності, які ви в нас заклали.

Ми безмежно вдячні вам за вашу турботу, тепло і любов, які супроводжували нас усе життя. Для нас дуже важливо, щоб у цей особливий день ви були поруч і розділили з нами цю радість.

З любов’ю, ваші діти ❤️`,
    shlikhta_brother_family: `Дорогі Женя і Альона!

Запрошуємо вас розділити з нами день створення нашої сімʼї.

Євга, ти завжди був поруч - інколи строгий, інколи «токсік», але завжди той, хто оберігав мене і підтримував по-своєму. Я знаю, що ти щиро радієш за мене, і для мене це дуже важливо.

Альона, дякую тобі за тепло, розуміння і те, що з моїм братом - ви справжня сила.

Нам буде дуже цінно провести цей день разом із вами. Жу, і, звісно, чекаємо на твою легендарну шляпу🤭

З любов’ю Юра і Юля❤️`,
    artur_zoriana:
      "Дорогі Артур і Зорянія! Запрошуємо вас потусити разом у цей день і стати свідками найважливішої події в нашому житті — створення нашої сім’ї. Будемо дуже раді бачити вас поруч.",

    // Родичі
    katya_petro: `Дорогі Катя і Петро!

Запрошуємо вас стати свідками створення нашої сімʼї.

Для нас ви не просто тітка і дядько, а по-справжньому близькі люди - частина нашої сімʼї. Ваша підтримка, турбота і тепло завжди були дуже важливими, і ми щиро вдячні вам за це.

Для нас буде великою радістю розділити цей особливий день разом із вами, адже ви займаєте особливе місце в нашому житті.

З любов’ю, Юра та Юля ❤️`,
    vitya_marta: helpers.getDefaultInviteText("Віктор і Марто"),
    sasha_bro:
      `Сашка!

Запрошуємо тебе на найважливіший день у нашому житті — створення нашої сімʼї!

Нам буде дуже приємно, якщо ти розділиш із нами цей день і додаси ще більше настрою та драйву до свята 🥰

Чекаємо на тебе!`,
    pavlyshynets:
      `Дорога сімʼє Павлишинець!

Запрошуємо вас стати частиною особливого дня - створення нашої сімʼї.

Альоно, Мішко та Настю, нам дуже приємно, що ви є в нашому житті. Ваша щирість, тепло і родинна атмосфера завжди створюють відчуття затишку та радості. Ми щиро цінуємо наш зв’язок і будемо безмежно раді розділити цей важливий момент разом із вами. 
P.S. Шкода, що Мішка не може привести своєї пюрешки на весілля🤤

Чекаємо на вас із Франківська з гарним настроєм і усмішками ❤️`,
    khodiuk_parents: `Дорогі мама і тато!

Запрошуємо вас стати свідками створення нової сімʼї.

Настав час нам створити власну сім’ю, спираючись на ті цінності, які ви в нас заклали.

Ми безмежно вдячні вам за вашу турботу, тепло і любов, які супроводжували нас усе життя. Для нас дуже важливо, щоб у цей особливий день ви були поруч і розділили з нами цю радість.

З любов’ю, ваші діти ❤️`,
    viktoria_vitalii: helpers.getDefaultInviteText("Вікторія та Віталій"),
    alik_tetiana: helpers.getDefaultInviteText("Алік і Тетяна"),
    oleksand_olesia:
      "Дорога сім`я Климчуків! Запрошуємо вас розділити цю важливу подію у нашому житті будемо дуже раді бачити вас поруч у цей особливий момент.",
    vitalii:
      "Дорогий Віталій! Запрошуємо тебе на цю важливу подію у нашому житті. Будемо дуже раді бачити тебе поруч у цей особливий момент, разом святкувати, радіти й створювати незабутні спогади.",
    // Колеги
    vova: "Дорогий Володимир! Запрошуємо тебе на цю важливу подію у нашому житті. Будемо дуже раді бачити тебе поруч у цей особливий момент. Треба буде трошки рими наскладати і реп зачитати🤣",
    ihor_valeriia:
      `Дорогі Ігор (начальнік) та Валерія!

      Запрошуємо вас на цю важливу подію у нашому житті. В честь цього вібудеться грандіозна туса
      Навіть ведучим буде Ігора сусід😎
      Будемо дуже раді бачити вас поруч у цей день.
      
      З любов'ю Юля та Юра ❤️ і FUCK OFF чи шо
      `,
    ivan_colleague:
      "Дорогий Іван! Запрошуємо тебе на цю важливу подію у нашому житті. Будемо дуже раді бачити тебе поруч у цей особливий момент🤣",
    ivan_svitlana: helpers.getDefaultInviteText("Іван і Світлана"),
    vitalii_tetiana: helpers.getDefaultInviteText("Віталій і Тетяна"),

    maksym_oleksandra: helpers.getDefaultInviteText("Максим і Олександра"),
    mykola_tetiana: helpers.getDefaultInviteText("Микола і Тетяна"),
  };
})(window);
